import telebot

bot = telebot.TeleBot("8594256267:AAHedWPdOEM_A5Rx9qrPvTKT6-DyAEQ8mOM")

functions = {
    '/start': 'Начинает диалог с тобой',
    '/bye': 'Завершает диалог с тобой',
    '/what': 'Помогает узнать тебе, что такое глобальное потепление',
    '/why': 'Расскажет тебе, почему возникает глобальное потепление',
    '/happen': 'Расскажет тебе, что произойдет, если глобальное потепление ускорит свой темп',
    '/do': "Что нужно сделать, чтобы проблема глобального потепления не возникала или вовсе пропала"
}

@bot.message_handler(commands=['start'])
def send_welcome(message):
    bot.reply_to(message, "Привет! Я твой Telegram бот, которые может ответить на твои вопросы по глобальному потеплению!🏔️ ")


@bot.message_handler(commands=['bye'])
def send_bye(message):
    bot.reply_to(message, "Поздравляю, вы полностью изучили проблему глобального потепления!😁")


@bot.message_handler(commands=['info'])
def send_info(message):
    bot.send_message(message.chat.id, str(functions))

bot.polling()